In [120]:
import pandas as pd
import seaborn as sns
import numpy as np

**Q1. List any five functions of the pandas library with execution.**

In [14]:
df = sns.load_dataset('iris')
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [17]:
# Pandas mean function
df['petal_length'].mean()

3.7580000000000005

In [20]:
# Pandas unique function
df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [26]:
# Pandas value_count function
df['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [28]:
# Pandas dtypes function
df.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [31]:
# Pandas tail function
df.tail(10)

     sepal_length  sepal_width  petal_length  petal_width    species
140           6.7          3.1           5.6          2.4  virginica
141           6.9          3.1           5.1          2.3  virginica
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

**Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.**

In [78]:
dict1 = {
    "A" : [1,2,3,4,5],
    "B" : [1,2,3,4,5],
    "C" : [1,2,3,4,5],
}
df1 = pd.DataFrame(dict1)
df1

   A  B  C
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5

In [87]:
labels = [i for i in range(0, df1.shape[0])]
k = 1
for idx in range(0, len(l)):
    labels[idx] = labels[idx] + k
    k += 1
df2 = df1.reindex(labels = labels)
df2

     A    B    C
1  2.0  2.0  2.0
3  4.0  4.0  4.0
5  NaN  NaN  NaN
7  NaN  NaN  NaN
9  NaN  NaN  NaN

**Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.  
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.**

In [20]:
val = [10, 20, 30, 40, 50]
df3 = pd.DataFrame(val, columns = ["Values"])
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [21]:
ans = 0
for idx, val in df3['Values'].items():
    ans += val
    if idx == 2:
        break
print(ans)

60

**Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.**

In [25]:
names = ["Pratap", "Ranjan", "Anju", "Manju"]
df4 = pd.DataFrame(names, columns = ["Name"])
df4

     Name
0  Pratap
1  Ranjan
2    Anju
3   Manju

In [29]:
df4["Names_Length"] = df4['Name'].apply(len)
df4

     Name  Names_Length
0  Pratap             6
1  Ranjan             6
2    Anju             4
3   Manju             5

**Q5. How are DataFrame.size() and DataFrame.shape() different?**

DataFrame.size gives the count as (number of rows * number of columns)
DataFrame.shape returns a tuple with number of rows and columns separately

In [35]:
print(df4.size)
print(df4.shape)
print(type(df4.shape))

8
(4, 2)
<class 'tuple'>

**Q6. Which function of pandas do we use to read an excel file?**

The function used to read csv files using pandas is **read_csv**

**Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.**  

**The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.**

In [36]:
emails = ["pratapkumar.chandra@yahoo.com", "bishwajeet@gmail.com"]
df5 = pd.DataFrame(emails, columns = ["Email"])
df5

                           Email
0  pratapkumar.chandra@yahoo.com
1           bishwajeet@gmail.com

In [38]:
df5["Username"] = df5["Email"].apply(lambda x : x.split("@")[0])
df5

                           Email             Username
0  pratapkumar.chandra@yahoo.com  pratapkumar.chandra
1           bishwajeet@gmail.com           bishwajeet

**Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:**  

  A B C  
0 3 5 1  
1 8 2 7  
2 6 9 4  
3 2 3 5  
4 9 1 2  

**Your function should select the following rows:**  
A B C  
1 8 2 7  
4 9 1 2  
**The function should return a new DataFrame that contains only the selected rows.**

In [71]:
a = pd.Series([3,8,6,2,9])
b = pd.Series([5,2,9,3,1])
c = pd.Series([1,7,4,5,2])
df6 = pd.concat(objs = [a,b,c], axis = 1)
df6.columns = ["A", "B", "C"]
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [76]:
df7 = df6[(df6['A'] > 5) & (df6['B'] < 10) ]
df7

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

**Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.**

In [85]:
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [92]:
print("Mean: ", df3['Values'].mean())
print("Median: ", df3['Values'].median())
print("Standard Deviation: ", df3['Values'].std())

Mean:  30.0
Median:  30.0
Standard Deviation:  15.811388300841896

**Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.**

In [115]:
dates = pd.Series(["2023-05-10","2023-05-11","2023-05-12","2023-05-13","2023-05-14","2023-05-15","2023-05-16","2023-05-17","2023-05-18"])
sales = pd.Series([100,200,300,400,500,600,700,800,900])
df8 = pd.concat(objs = [pd.to_datetime(dates), sales], axis = 1)
df8.columns = ["Date", "Sales"]
df8

        Date  Sales
0 2023-05-10    100
1 2023-05-11    200
2 2023-05-12    300
3 2023-05-13    400
4 2023-05-14    500
5 2023-05-15    600
6 2023-05-16    700
7 2023-05-17    800
8 2023-05-18    900

In [119]:
df8["MovingAverage"] = df8["Sales"].rolling(window = 7).median()
df8

        Date  Sales  MovingAverage
0 2023-05-10    100            NaN
1 2023-05-11    200            NaN
2 2023-05-12    300            NaN
3 2023-05-13    400            NaN
4 2023-05-14    500            NaN
5 2023-05-15    600            NaN
6 2023-05-16    700          400.0
7 2023-05-17    800          500.0
8 2023-05-18    900          600.0

**Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.**  
**For example, if df contains the following values:**  
Date  
0 2023-01-01  
1 2023-01-02  
2 2023-01-03  
3 2023-01-04  
4 2023-01-05  

**Your function should create the following DataFrame:**  

Date Weekday  
0 2023-01-01 Sunday  
1 2023-01-02 Monday  
2 2023-01-03 Tuesday  
3 2023-01-04 Wednesday  
4 2023-01-05 Thursday  

**The function should return the modified DataFrame.**

In [124]:
date = pd.Series(["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"])
df9 = pd.DataFrame(pd.to_datetime(date), columns=["Date"])
df9

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [130]:
df9["Weekday"] =  df9["Date"].apply(lambda x : x.day_name())
df9

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

**Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.**

In [163]:
date = ["2023-01-01 16:45:17.006302", "2023-01-11 16:45:17.006302", "2023-01-30 16:45:17.006302", "2023-02-15 16:45:17.006302", "2023-03-21 16:45:17.006302"]
df10 = pd.DataFrame(pd.to_datetime(date), columns = ["Date"])
df10

                        Date
0 2023-01-01 16:45:17.006302
1 2023-01-11 16:45:17.006302
2 2023-01-30 16:45:17.006302
3 2023-02-15 16:45:17.006302
4 2023-03-21 16:45:17.006302

In [211]:
df10[df10["Date"].apply(lambda x : x.year >= 2023 and x.month == 1 and x.day >= 1 and x.day <= 31)]

                        Date
0 2023-01-01 16:45:17.006302
1 2023-01-11 16:45:17.006302
2 2023-01-30 16:45:17.006302

**Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?**

We should import Pandas library and mention an alias in order to avoid writing "pandas" again and again.

The import statement is : **import pandas as pd**